# # In Emacs org-mode: before exporting, comment this out START
# ;; Local Variables:
# ;; ispell-check-comments: exclusive
# ;; ispell-local-dictionary: "english"
# ;; End:
# # In Emacs org-mode: before exporting, comment this out FINISH

# Org-mode Export LaTeX Customization Notes:
# - Interpret 'bla_bla' as LaTeX Math bla subscript bla: #+OPTIONS ^:t. Interpret literally bla_bla: ^:nil.
# - org export: turn off heading -> section numbering: #+OPTIONS: num:nil
# - org export: change list numbering to alphabetical, sources:
#   - https://orgmode.org/manual/Plain-lists-in-LaTeX-export.html
#   - https://tex.stackexchange.com/a/129960
#   - must be inserted before each list:
#     #+ATTR_LATEX: :environment enumerate
#     #+ATTR_LATEX: :options [label=\alph*)]
# - allow org to recognize alphabetical lists a)...: M-x customize-variable org-list-allow-alphabetical


# -----------------------
# General Export Options:
#+OPTIONS: ^:nil ':nil *:t -:t ::t <:t H:3 \n:nil arch:headline
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: f:t inline:t p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t title:t todo:t |:t

#+OPTIONS: author:Johannes Wasmer
#+OPTIONS: email:johannes.wasmer@gmail.com
# #+AUTHOR: Johannes Wasmer
# #+EMAIL: johannes.wasmer@gmail.com

# for org for web (eg gitlab, github): num:nil, toc:nil. using custom Table of Contents below.
# for tex/pdf export, temporarily: num:t, toc:t. replace * Table of Contents -> * COMMENT Table of Contents.
#+OPTIONS: num:nil
# t or nil: disable export latex section numbering for org headings
#+OPTIONS: toc:nil
# t or nil: no table of contents (doesn't work if num:nil)

#+TITLE: dtc-workshop-notes-wasmer
#+SUBTITLE:
#+DATE: <2023-05-14 Sun>
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 28.2 (Org mode 9.6.5)

# ---------------------
# LaTeX Export Options:
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
** DONE Install Python environment - Part 1
CLOSED: [2023-05-16 Tue 15:01]
:PROPERTIES:
:CUSTOM_ID: h-ADF231F6-6755-486C-82B4-C53B969BAF5D
:END:

This part: Creating a ~requirements.txt~ file that works for my hardware, Apple
MacBook Pro M2.

For both branches: the [[https://github.com/RCdeWit/dtc-workshop/blob/e69b85bd79602d6491b52da32569e4e6331373a9/requirements.txt#L1][requirements.txt]]

- assumes strict version constraints for compatibility
- assumes as hardware an older Apple Mac with M1 chip. That's why they use
  =tensorflow-macos= and =tensorflow-metal=, and specific versions.For other
  hardware, such as my M2 chip,replace with =tensorflow=. In the video, they
  replace with ~tensorflow==2.11.0=~

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop/requirements.txt
#+end_src

#+RESULTS:
#+begin_example
notebook==6.5.2
dvc[all]==2.44.0
tensorflow-macos==2.9
tensorflow-metal==0.5.0
pandas==1.5.3
pillow==9.4.0
matplotlib==3.6.3
scikit-learn==1.2.1
isort==5.12.0
pickle-mixin==1.0.2
#+end_example


I deviate from that.

In both branches, I replace the M1 tensorflow versions with =tensorflow=. I
replace =notebook= with =jupyterlab=, cause it is the sucessor and I prefer to
have it. Update: ADD =jupyterlab= to =notebook= because your IDE (eg PyCharm)
might require =notebook= in the environment. Both are developed in conjunction,
but are completely separate.

In branch ~vscode-dvc~, VSCode extension DVC version v08.11 complained that
extension is not compatible with ~dvc[all]==2.44.0~ and requires at least
~dvc[all]==2.56.0~. So, I lift all veersion constraints here.

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop/requirements-original.txt
#+end_src

#+RESULTS:
#+begin_example
notebook==6.5.2
dvc[all]==2.44.0
tensorflow-macos==2.9
tensorflow-metal==0.5.0
pandas==1.5.3
pillow==9.4.0
matplotlib==3.6.3
scikit-learn==1.2.1
isort==5.12.0
pickle-mixin==1.0.2
#+end_example

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop/requirements.txt
#+end_src

#+RESULTS:
: jupyterlab
: dvc[all]
: tensorflow
: pandas
: pillow
: matplotlib
: scikit-learn
: isort
: pickle-mixin

In branch ~pycharm~, I only adopt the same ~tensorflow==2.11.0~ version as in
the tutorial video and leaving everything else as is produced a patchy
environment. So I also went with the constraintless reqs version here. I could
enforce ~dvc[all]==2.56.0~ here since not bound by DVC extension. But better
keep needed adjustments consistent between both branches, so same env. As for
the =pickle-mixin=, I can always commit a freeze env later (pickle serializes
Python objects; deserialization is only guaranteed to work with the exact same
package versions), if DVC does not already support on its own.

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/requirements.txt
#+end_src

#+RESULTS:
: jupyterlab
: notebook
: dvc[all]
: tensorflow
: pandas
: pillow
: matplotlib
: scikit-learn
: isort
: pickle-mixin

(Update <2023-05-16 Tue>: Added ~notebook~ cause PyCharm Jupyter notebooks
require ~notebook~ not ~jupyterlab~ to work properly, see my [[https://youtrack.jetbrains.com/issue/PY-35688/Jupyter-notebook-using-wrong-executable-and-path#focus=Comments-27-7335157.0-0][error & solution
report]].)

In both branches, I rename the old requirements file to
=requirements-original.txt= and the new one to =requirements.txt=. Both IDEs by
default install env fixed on this filename, so this swap makes that easier.

*How to create a Python environment from requirements.txt with IDEs VSCode, PyCharm*.

Create venv/pip env from requirements file in PyCharm. Note that PyCharm
automatically selects the file ~requirements.txt~ for this. Project Settings >
Add interpreter > PyCharm creates the env in the repo folder =./venv=. Create,
done.

Create venv/pip env from requirements file in VSCode. Command Palette >
Python: Create environment > Leave all default (package manager venv, Python
version, requirements file selection). Create. VSCode creates the env in the
repo folder =./.venv=.

Side note: To delete the env, eg if something went wrong, in both cases, just
remove the corresponding folder and repeat process.

Now I freeze the installed environments.

In PyCharm, Tools > Sync Python Environments did not work for me.

So, in both branches / IDEs, I did ~pip freeze > requirements.txt~, hand-picked
out above libraries (ie, delete all others from the file), and overwrote
=requirements.txt= with that again.

(While doing it also found out, that again, PyCharm had not installed many of
the reqs in the env, even without version constraints. So, next time do it with
~pip~ direcly, in the first place ... The env install via VSCode worked,
however.)

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop/requirements.txt
#+end_src

#+RESULTS:
: jupyterlab==3.6.3
: dvc[all]==2.56.0
: tensorflow==2.12.0
: pandas==2.0.1
: Pillow==9.5.0
: matplotlib==3.7.1
: scikit-learn==1.2.2
: isort==5.12.0
: pickle-mixin==1.0.2

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/requirements.txt
#+end_src

#+RESULTS:
: jupyterlab==3.6.3
: notebook==6.5.4
: dvc[all]==2.56.0
: tensorflow==2.12.0
: pandas==2.0.1
: Pillow==9.5.0
: matplotlib==3.7.1
: scikit-learn==1.2.2
: isort==5.12.0
: pickle-mixin==1.0.2

However, then I found out that on my MacBook Pro M2, these Tensorflow
installations did not work. So, got to do an intermezzo, how to install
TensorFlow on Apple M2 in 2023-05. Putting that in phd-project-wasmer > work
journal > install tensorflow, pytorch, jax on Apple M2

- [[https://iffgit.fz-juelich.de/phd-project-wasmer/notes/public/-/blob/main/work/work-journal/themed/2023-05-13-deep-learning-on-apple-m2/deep-learning-on-apple-m2.org][web link]]
- [[file:~/src/iffgit.fz-juelich.de/phd-project-wasmer/notes/main/public/work/work-journal/themed/2023-05-13-deep-learning-on-apple-m2/deep-learning-on-apple-m2.org][local file link]]

After analysis there, it turns out that venv/pip env creation with
VSCode/PyCharm venv/pip env creation features does NOT produce a working
TensorFlow installation, but doing it by hand with venv/pip from same
requirements file without version constraints DOES produce a working TensorFlow
installation. So, I did that instead, removed the environments created by the
two respective IDEs, and copied the resulting environment folder into the
respective VSCode / PyCharm projects.

Update: pip/venv environments are tied to their locations. The paths are stored
in the venv's config files. When moving or copy-pasting them, update those
references by hand to the new location. Google how to do that.

#+begin_src shell
rm -rf ~/src/github.com/irratzo/forks/dtc-workshop/.venv
rm -rf ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/venv

cp -r ~/venvs/venv-dtc-workshop ~/src/github.com/irratzo/forks/dtc-workshop/.venv
cp -r ~/venvs/venv-dtc-workshop ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/venv

rm -rf ~/venvs/venv-dtc-workshop ~/venvs/venv-dtc-workshop-requirements.txt
#+end_src

Here is the pinned requirements of that env after install from requirements with
not version constraints, performed on <2023-05-14 Sun>, now the same for both
branches.

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop/requirements.txt
#+end_src

#+RESULTS:
: jupyterlab==3.6.3
: dvc[all]==2.56.0
: tensorflow==2.13.0rc0
: pandas==2.0.1
: Pillow==9.5.0
: matplotlib==3.7.1
: scikit-learn==1.2.2
: isort==5.12.0
: pickle-mixin==1.0.2

Select the new env.

In VSCode, Command Palette > Python: Select interpreter.

In PyCharm, Project Settings > Pyton Interpreter.

Finally, check that the env now works, including TensorFlow.

In both editors, open the classification Jupyter notebook, and run the "Imports"
cell. It should run now without error. Maybe have to select the correct kernel
first.

** Notebook intro
:PROPERTIES:
:CUSTOM_ID: h-EB2D69FE-671E-4DCF-8D0F-08A91D08F9C2
:END:
Tutorial video timestamp [[https://www.youtube.com/watch?v=6x6GwtNeYdI&t=21m38s][21:38]].

Run the notebook ~pokemon_classifier.ipynb~ and explain what it does.

I added minor additional explanations right inside the notebook , for now on
branch ~pycharm~.

Explanation of the Jupyter notebook model pipeline, Pokemon binary classifier,
CNN model, TensorFlow.

The dataset before preprocessing consists of a CSV table with 802 samples, and a
folder of images, one Pokemon per image.

#+begin_src shell :results output
ls ~/src/github.com/irratzo/forks/dtc-workshop/data/external/images | wc -l
#+end_src

#+RESULTS:
:      905

** Plot training history and save model
:PROPERTIES:
:CUSTOM_ID: h-2696EE8D-5E77-46CF-88EB-EA99C46791F9
:END:

The function ~save_estimator~ plots loss and accuracy of the model during
training, and saves the model to disk under ~$PROJECT/outputs/model~. With
Keras, we don't need to record those separately, but can access it after
training from ~estimator.history~.

Note that the [[https://keras.io/api/saving/][Keras save]] method saves the model as a /directory/, not a single
file. The ~.pb~ file format is Google's [[https://github.com/protocolbuffers/protobuf][protobuf]] format. It can store, among
other things, TensorFlow neural network.

#+begin_src shell :results output
tree ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/outputs/
#+end_src

#+RESULTS:
#+begin_example
~/src/github.com/irratzo/forks/dtc-workshop-pycharm/outputs/
|-- model
|   |-- assets
|   |-- fingerprint.pb
|   |-- keras_metadata.pb
|   |-- saved_model.pb
|   `-- variables
|       |-- variables.data-00000-of-00001
|       `-- variables.index
`-- train_history.png

3 directories, 6 files
#+end_example

** Validation
:PROPERTIES:
:CUSTOM_ID: h-35A75BA7-5A0B-416B-9724-1C5F20498992
:END:

With "validation" here, model performance, model evaluation is meant, NOT data
split train/test.)

The function ~predict_pokemon~ takes the trained model for a spin, predicting
whether a given Pokemon is Water type or not, and printing its image.

The next cell loads the model and data from disk, as part of the pipeline
DAG I/O perspective. From the DVC pipeline DAG I/O perspective, the validation
stage requires to load the model and the data from disk, as input.

Next, the ~predictions = model.predict(X) > 0.5~ is called (returns a True/False
binary classification Numpy array for each sample). These are then used to
compute model metrics for classification tasks, accuracy, precision, recall and
F1 score. Note that these are computed on the /whole/ dataset from the predicted
and true labels ~(predictions, y)~.

Finally, a confusion matrix is plotted and saved. Note that the model almost
always classifies Water Pokemons correctly, but is not better at classifying
non-Water Pokemon than random guessing. Again, probably due to class imbalance.

The tutor again emphasized, such a model would not be put into production, it is
merely a working example for this tutorial.

So, this is the model prototype.

At the end of the notebook run, the ~data~ folder looks like this.

#+begin_src shell :results output
cd ~/src/github.com/irratzo/forks/dtc-workshop-pycharm
tree -L 2 data/
#+end_src

#+RESULTS:
#+begin_example
data/
|-- external
|   |-- images
|   |-- pokemon-images.zip
|   |-- pokemon.zip
|   `-- stats
|-- external.dvc
`-- processed
    |-- X.pckl
    |-- X_test.pckl
    |-- X_train.pckl
    |-- pokemon
    |-- pokemon-with-image-paths.csv
    |-- pokemon.csv
    |-- y.pckl
    |-- y_test.pckl
    `-- y_train.pckl

5 directories, 11 files
#+end_example

** Setting up DVC and tracking data - dvc init
:PROPERTIES:
:CUSTOM_ID: h-D43969B6-78FF-45E5-8DB2-636BBDFCC1C6
:END:

Tutorial repo [[https://github.com/RCdeWit/dtc-workshop#setting-up-dvc-and-tracking-data][section]].

Tutorial video timestamp [[https://www.youtube.com/watch?v=6x6GwtNeYdI&t=30m25s][30:25]].

#+begin_quote
This point may be familiar to you: a working prototype in a notebook. Now, how
do we transform it into a reproducible DVC pipeline?
#+end_quote

From the motivating example, say we change the dataset because of integration of
a new set of Pokemons. Then we run another experiment characterized by this
changed data, and maybe we also want to adapt the model or try out different
parameters. Then, all of the serialized input and output data and models and
metrics would be overwritten. We don't want that. So we'll start data versioning
with DVC now.

Start with adding the first input data.

Input in branches ~pycharm~ PyCharm terminal / ~vscode-dvc~ VSCode terminal.

Note that ~dvc~ CLI is modeled closely on the ~git~ CLI, so often, a Git+DVC
project vs. a Git DVC project requires to repeat the same or similar command
twice, once for code and once for data.

#+begin_src shell
# init DVC
dvc init
# if .dvc/ already exists
dvc init -f

# add external data
dvc add data/external/
#+end_src

This has two effects. The directory is added to the local ~.gitignore~, and a
file ~external.dvc~ is created.

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/data/.gitignore
#+end_src

#+RESULTS:
: /external
: outs:
: - md5: 8caf358d685344d3eb8b0ee6783275ff.dir
:   size: 235910211
:   nfiles: 908
:   path: external

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/data/external.dvc
#+end_src

#+RESULTS:
: outs:
: - md5: 8caf358d685344d3eb8b0ee6783275ff.dir
:   size: 235910211
:   nfiles: 908
:   path: external

Only evident in the tutorial video: ~git status~ reveals that also created three
new files were created, ~.dvc/.gitignore~, ~.dvc/config, ~.dvcignore~. This is
not evident when starting with the tutorial repo, cause it already has a
~.dvc/~, so DVC was already initialized.

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/.dvc/.gitignore
#+end_src

#+RESULTS:
: /config.local
: /tmp
: /cache

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/.dvc/config
#+end_src

#+RESULTS:

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/.dvcignore
#+end_src

#+RESULTS:
: # Add patterns of files dvc should ignore, which could improve
: # the performance. Learn more at
: # https://dvc.org/doc/user-guide/dvcignore

*Application to personal projects.*

- single-impurity-database.
  - Add script / notebook cell to download [[https://molmod.ugent.be/deltacodesdft][deltacodesdft]] structures
  - Add as ~data/external~
- jij-prediction.
  - add AiiDA-exported data as ~data/external~ or ~data/input~.
** Setting up DVC and tracking data - Add a remote for data
:PROPERTIES:
:CUSTOM_ID: h-BA6D6140-CF9E-47D6-A255-CC97C125EABB
:END:

Tutorial video timestamp [[https://www.youtube.com/watch?v=6x6GwtNeYdI&t=35m0s][35:00]].

Just as Git has a remote storage for code and associate command ~git push~, in
this case GitHub, DVC allows to add a remote for data and associate command ~dvc
push~.

See [[https://dvc.org/doc/user-guide/data-management/remote-storage#remote-storage][DVC docs - Remote Storage]].

Video tutorial uses [[https://dvc.org/doc/user-guide/data-management/remote-storage/google-drive#how-to-setup-a-google-drive-dvc-remote][Google Drive]] as remote storage for demo puposes. I, however,
use self-hosted SSH.

- DVC allows [[https://dvc.org/doc/user-guide/data-management/remote-storage#self-hosted--on-premises][self-hosted remote storage]]: SSH, HDFS, HTTP, WebDAV.
- Try to set this up for my projects to sync to ~/Data/division/iff-user~ via
  SSH. (Replace ~iff-user~ placeholder with real username.)

Okay, on SSH remote ~ifflinux~, have now set up remote directory
=/Data/division/iff-user/dvc/dtc-workshop= for this project. Try adding that now
following the [[https://dvc.org/doc/user-guide/data-management/remote-storage/ssh][DVC docs - SSH]] page.

As docs suggest, first verify connection works for ~ssh~ and ~sftp~.

#+begin_src shell
ssh iff-user@ifflinux.iff.kfa-juelich.de
logout
sftp iff-user@ifflinux.iff.kfa-juelich.de
exit
#+end_src

Now, on branch ~pycharm~. Add the remote and push the DVC commits.

#+begin_src shell
# # add remote to repo
# dvc remote add -d myremote ssh://user@example.com:2222/path
dvc remote add -d iff-main ssh://iff-user@ifflinux.iff.kfa-juelich.de/Data/division/iff-user/dvc/dtc-workshop

# Actually, later I changed the remote storage location again, to reflect the
# folder structure in my ~/src/ folder, which in turn reflects all my projects'
# source code remote locations. Now, the folder trees of ~/src and ~/dvc/ can
# be identical, avoiding confusion.
dvc remote modify iff-main url ssh://wasmer@ifflinux.iff.kfa-juelich.de/Data/ias-1/wasmer/dvc/github.com/irratzo/forks/dtc-workshop

# # add SSH key for SSH remote login
# dvc remote modify --local myremote keyfile /path/to/keyfile
dvc remote modify --local iff-main keyfile ~/.ssh/id_rsa

# # push commits (here, data/external) to remote, as initial test
dvc push

# # if successful, commit config change
git add .dvc ; git commit -m "dvc remote add -d iff-main (remote repo for project data)"
git push origin pycharm
#+end_src

The ~dvc remote add~ updated the DVC config.

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/.dvc/config
#+end_src

#+RESULTS:
: [core]
:     remote = iff-main
: ['remote "iff-main"']
:     url = ssh://wasmer@ifflinux.iff.kfa-juelich.de/Data/ias-1/wasmer/dvc/github.com/irratzo/forks/dtc-workshop

After the ~dvc push~, the remote storage is populated. But not with the
identical content of ~data/external~, but instead hash-based folders ~00/~ to
~ff/~, with hash-based files in them, like ~ff/e39770f78253994bf4a4db7e8d6d7b~.
Looks a lot like the old AiiDA remote (working directory) file storage scheme
(which they replaced with object storage cause this method produced too many
inodes ... doesn't DVC potentially cause the same problem here?). These
correspond to the file hashes stored in the repo's ~.dvc/cache/~.

Now, the interesting question is, how to sync that with the branch ~vscode-dvc~?
I can't do the same and ~dvc push~ there, since the data is already in the
remote. So instead, I could try to tmp move local ~data/external~ to the side,
do a ~dvc pull~ instead and see if the data gets downloaded.

On branch ~vscode-dvc~.

#+begin_src shell
# (all except third command same as above in other repo)

# # add remote to repo
# dvc remote add -d myremote ssh://user@example.com:2222/path
dvc remote add -d iff-main ssh://iff-user@ifflinux.iff.kfa-juelich.de/Data/division/iff-user/dvc/dtc-workshop

# # add SSH key for SSH remote login
# dvc remote modify --local myremote keyfile /path/to/keyfile
dvc remote modify --local iff-main keyfile ~/.ssh/id_rsa

# remove (or mv backup) local data/external and replace with the one from remote
rm -rf data/external
dvc pull

# if successful, commit config change
git add .dvc ; git commit -m "dvc remote add -d iff-main (remote repo for project data)"
git push origin vscode-dvc
#+end_src

It worked! ~dvc pull~ restored the original ~data/external~ contents from the
remote. Note here that this also worked because the DVC remote does not have any
branches, or we at least have not specified them. So, differently from the code
remote repo, all code branches see the same remote DVC data.

*Application to personal projects.*

- Set this up for all my personal projects with data. Also use
  ~/Data/division/username/dvc/~ as base. Mind the ~quota~ on ~/Data~.
  - single-impurity-database.
    - all data not stored in AiiDA / iffAiiDA.
    - Minor detail: What about archives exported from AiiDA DB?
  - jij-prediction.

* DONE Create ~params.yaml~
CLOSED: [2023-05-17 Wed 11:52]
:PROPERTIES:
:CUSTOM_ID: h-FF6779C7-EFC7-48F3-A552-5CCFDE258EA5
:END:

Tutorial repo [[https://github.com/RCdeWit/dtc-workshop#create-paramsyaml][section]].

Tutorial video timestamp [[https://www.youtube.com/watch?v=6x6GwtNeYdI&t=41m37s][41:37]].

Now we are finally set up to start building a [[https://dvc.org/doc/user-guide/pipelines#pipelines][DVC pipeline]].

Create ~./params.yaml~, same content as in tutorial repo README section. Similar
to parameters in notebook.

#+begin_src shell :results output
cat ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/params.yaml
#+end_src

#+RESULTS:
#+begin_example
base:
  seed: 42
  pokemon_type_train: "Water"

data_preprocess:
  source_directory: 'data/external'
  destination_directory: 'data/processed'
  dataset_labels: 'stats/pokemon-gen-1-8.csv'
  dataset_images: 'images'

train:
  test_size: 0.2
  learning_rate: 0.001
  epochs: 15
  batch_size: 120
#+end_example

#+begin_src shell
git add params.yaml; git commit -m "start build DVC pipeline, create params.yaml" ; git push origin branch-name
#+end_src

** Turn notebook into to Python modules - Copy solution
:PROPERTIES:
:CUSTOM_ID: h-96663827-0B41-4373-A8A0-5413222DF07D
:END:

Tutorial repo [[https://github.com/RCdeWit/dtc-workshop#create-python-modules][section]].

Tutorial video timestamp [[https://www.youtube.com/watch?v=6x6GwtNeYdI&t=42m50s][42:50]].

Turn the notebook prototype into Python modules. We'll use the solution's
[[https://github.com/RCdeWit/dtc-workshop/commit/1881a0e6cf9379eea53355f6e3fdd76890f48eac][specific commit]], where the tutor committed the finished ~src/~ folder from this
step to the solution repo.

#+begin_src shell
git clone git@github.com:RCdeWit/dtc-workshop.git dtc-workshop-solution
cd dtc-workshop-solution
git checkout 1881a0e6cf9379eea53355f6e3fdd76890f48eac
cp -r src ../dtc-workshop-pycharm
cp -r src ../dtc-workshop-vscode-dvc
#+end_src

#+begin_src shell :results output
tree -I "*.pyc" -I "__pycache__" ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/src
#+end_src

#+RESULTS:
: ~/src/github.com/irratzo/forks/dtc-workshop-pycharm/src
: |-- data_load.py
: |-- data_preprocess.py
: |-- evaluate.py
: |-- train.py
: `-- utils
:     `-- find_project_root.py
:
: 1 directory, 5 files

